<?php

/* @var $this yii\web\View */

$this->title = 'PHP – тестовое задание';
?>
<div class="site-index">

    <div class="body-content">

        <p>Реализовать на Yii2 инструменты работы с товарами и заказами с минимальным необходимым интерфейсом. Спроектировать для этого MySQL базу данных с необходимыми таблицами и связями между ними.</p>

        <p>Для товаров:</p>
        <ol>
            <li>Создание товара (название, цена, кол-во и т.д.)
            <li>Редактирование товара
            <li>Просмотр списка товаров и их поиск/фильтр
        </ol>

        <p>Для заказов:</p>
        <ol>
            <li>Создание заказа
            <li>Редактирование заказа
            <li>Добавление и удаление доступных товаров
            <li>Смена статуса заказа
            <li>Просмотр списка заказов и их поиск/фильтр (по статусу, по номеру и т.д.)
        </ol>

        <p>Проект для демонстрации разместить в репозитории GitHub, GitLab или любом другом (коммитов больше одного). Будет плюсом если работающие инструменты будут доступны для тестирования через интернет (хостинг или свой сервер).</p>
        <p>Свои улучшения и доработки приветствуются.</p>

    </div>
</div>
